import Image from 'next/image'
import Link from 'next/link'
import React from 'react'

export default function Footer() {
	return (
		<footer className="bg-blue-3 pt-5 pb-[20px]">
			<div className='container'>
				<div className='flex sm:flex-row items-center flex-col justify-center'>
					<Link className='sm:mb-[0px] mb-[40px]' href="/">
						<Image src={'/logo.png'} width={64} height={64} />
					</Link>
					<div className='2xl:max-w-[1000px] xl:max-w-[977px] md:max-w-[570px] sm:max-w-[450px] ml-auto mr-auto sm:mb-[0px] mb-[10px]'>
						<p className='text-grey-1 text-xxs font-light 2xl:text-xl xl:text-xs md:text-xs sm:text-xxs text-center'>
							Все права на&nbsp;материалы, размещенные на&nbsp;сайте www.shl.ru (далее&nbsp;&mdash; Сайт)
							и&nbsp;являющиеся объектами исключительных прав, в&nbsp;том числе на&nbsp;зарегистрированные товарные
							знаки и&nbsp;символику &quot;СХЛ&quot;/&quot;sHL&quot; (далее&nbsp;&mdash; Товарные знаки), а&nbsp;также
							на&nbsp;фото- и&nbsp;видеоизображения, статьи и&nbsp;т.п., правообладателем которых является
							ООО &laquo;СХЛ&raquo;, охраняются в&nbsp;соответствии с&nbsp;законодательством РФ. Размещение и/или
							использование Товарных знаков и&nbsp;иных объектов интеллектуальной собственности, правообладателем
							которых является ООО &laquo;СХЛ&raquo;, без согласования с&nbsp;ООО &laquo;СХЛ&raquo; рассматриваются
							и&nbsp;преследуются как нарушения интеллектуальных прав ООО &laquo;СХЛ&raquo; в&nbsp;соответствии
							с&nbsp;законодательством РФ. Запрещается автоматизированное извлечение информации Сайта любыми сервисами
							без официального разрешения ООО &laquo;СХЛ&raquo;. Цитирование с&nbsp;Сайта и&nbsp;сателлитных проектов
							официальных сообщений Континентальной хоккейной лиги допускается только при наличии прямой ссылки
							на&nbsp;сайт www.shl.ru.
						</p>
					</div>
					<div>
						<div className='flex sm:flex-col flex-row items-center justify-center'>
							<Link href="https://t.me/s/shl_mo" className='sm:mb-[1px] sm:mr-[0px] mr-[10px]'>
								<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 32 32" fill="none">
									<circle cx="16" cy="16" r="14" fill="#40B3E0" />
									<path
										d="M22.9866 10.2088C23.1112 9.40332 22.3454 8.76755 21.6292 9.082L7.36482 15.3448C6.85123 15.5703 6.8888 16.3483 7.42147 16.5179L10.3631 17.4547C10.9246 17.6335 11.5325 17.541 12.0228 17.2023L18.655 12.6203C18.855 12.4821 19.073 12.7665 18.9021 12.9426L14.1281 17.8646C13.665 18.3421 13.7569 19.1512 14.314 19.5005L19.659 22.8523C20.2585 23.2282 21.0297 22.8506 21.1418 22.1261L22.9866 10.2088Z"
										fill="white" />
									<defs>
										<linearGradient id="paint0_linear_87_7225" x1="16" y1="2" x2="16" y2="30"
										                gradientUnits="userSpaceOnUse">
											<stop stop-color="#37BBFE" />
											<stop offset="1" stop-color="#007DBB" />
										</linearGradient>
									</defs>
								</svg>
							</Link>
							<Link href="https://www.youtube.com/channel/UCxq7cpCS5HtQ4iTm1P6Xh5Q" className='sm:mb-[1px] sm:mr-[0px] mr-[10px]'>
								<svg xmlns="http://www.w3.org/2000/svg" width="30px" height="30px" viewBox="0 0 16 16" fill="none">
									<path fill="red"
									      d="M14.712 4.633a1.754 1.754 0 00-1.234-1.234C12.382 3.11 8 3.11 8 3.11s-4.382 0-5.478.289c-.6.161-1.072.634-1.234 1.234C1 5.728 1 8 1 8s0 2.283.288 3.367c.162.6.635 1.073 1.234 1.234C3.618 12.89 8 12.89 8 12.89s4.382 0 5.478-.289a1.754 1.754 0 001.234-1.234C15 10.272 15 8 15 8s0-2.272-.288-3.367z" />
									<path fill="#ffffff" d="M6.593 10.11l3.644-2.098-3.644-2.11v4.208z" />
								</svg>
							</Link>
							<Link href="https://vk.com/shlmo">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 48 48" width="30px" height="30px">
									<path fill="#2787f5"
									      d="M42,37c0,2.762-2.238,5-5,5H11c-2.761,0-5-2.238-5-5V11c0-2.762,2.239-5,5-5h26c2.762,0,5,2.238,5,5 V37z" />
									<path fill="#fff"
									      d="M35.937,18.041c0.046-0.151,0.068-0.291,0.062-0.416C35.984,17.263,35.735,17,35.149,17h-2.618 c-0.661,0-0.966,0.4-1.144,0.801c0,0-1.632,3.359-3.513,5.574c-0.61,0.641-0.92,0.625-1.25,0.625C26.447,24,26,23.786,26,23.199 v-5.185C26,17.32,25.827,17,25.268,17h-4.649C20.212,17,20,17.32,20,17.641c0,0.667,0.898,0.827,1,2.696v3.623 C21,24.84,20.847,25,20.517,25c-0.89,0-2.642-3-3.815-6.932C16.448,17.294,16.194,17,15.533,17h-2.643 C12.127,17,12,17.374,12,17.774c0,0.721,0.6,4.619,3.875,9.101C18.25,30.125,21.379,32,24.149,32c1.678,0,1.85-0.427,1.85-1.094 v-2.972C26,27.133,26.183,27,26.717,27c0.381,0,1.158,0.25,2.658,2c1.73,2.018,2.044,3,3.036,3h2.618 c0.608,0,0.957-0.255,0.971-0.75c0.003-0.126-0.015-0.267-0.056-0.424c-0.194-0.576-1.084-1.984-2.194-3.326 c-0.615-0.743-1.222-1.479-1.501-1.879C32.062,25.36,31.991,25.176,32,25c0.009-0.185,0.105-0.361,0.249-0.607 C32.223,24.393,35.607,19.642,35.937,18.041z" />
								</svg>
							</Link>
						</div>
					</div>
				</div>
			</div>
		</footer>
	)
}
